app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks"
SELECT "tasks".* FROM "tasks" WHERE "tasks"."complete" = ?  [["complete", "f"]]
---
  def index
    @tasks = Task.all
    @incomplete_tasks = Task.where(complete: false)

INSERT INTO "tasks" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "fsdf"], ["created_at", "2016-10-26 09:42:49.968118"], ["updated_at", "2016-10-26 09:42:49.968118"]]
---
  def create
    @task = Task.new(task_params)

    respond_to do |format|
      if @task.save

UPDATE "tasks" SET "complete" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["complete", "t"], ["updated_at", "2016-10-26 09:45:58.839483"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @task.update(task_params)